{'N0DhCV_-Qbg': {'React version 18 was released.': {'start': 0.26, 'duration': 2.58}, 'And since it is a major new version of React, it does, as you would expect, introduce some new, exciting features.': {'start': 2.84, 'duration': 7.51}, 'Thankfully though, it does not break your existing code.': {'start': 10.35, 'duration': 3.11}, 'What you learned about react still applies.': {'start': 13.46, 'duration': 2.02}, 'The code you write still is the same.': {'start': 15.48, 'duration': 2.59}, 'Updating indeed is a piece of cake.': {'start': 18.07, 'duration': 1.87}, 'All you have to do is run npm install and install the latest versions of React and React DOM.': {'start': 19.94, 'duration': 5.85}, "And then there's one single change you have to make to your code base to take advantage of all the new features unlocked and added by React 18.": {'start': 25.79, 'duration': 8.96}, 'You have to go to your route entry file, typically index js.': {'start': 34.75, 'duration': 3.83}, 'And then in that file, replace the import of React DOM from React DOM with this import where you import from React DOM slash client.': {'start': 38.58, 'duration': 10.43}, "So that's a tiny addition you have to make to this import statement.": {'start': 49.01, 'duration': 4.3}, 'And replace the line where you call React DOM render to render the root component into some element in the index HTML file with the line below, where you call create root on React DOM instead and you pass the root element in the index HTML file to create root.': {'start': 53.31, 'duration': 19.28}, 'And then on this root object, which is returned by create root, you call render to render the root component into this root element in index HTML.': {'start': 72.59, 'duration': 10.96}, "That's the only change you have to make to your code.": {'start': 83.55, 'duration': 2.97}, 'No other code changes are required.': {'start': 86.52, 'duration': 2.41}, "That's only in one file and only in these two lines of that file, as you see it super simple and all the rest you learned still applies.": {'start': 88.93, 'duration': 8.67}, "There's nothing else you have to change.": {'start': 97.6, 'duration': 2.99}, 'Now, why was this change made? Why was this syntax changed? Because by changing to it, you opt into a new set of features and into a lot of behind the scenes improvements and changes that were introduced by React 18.': {'start': 100.59, 'duration': 13.9}, "The most important new feature introduced by React 18 is a feature called concurrency, and that's actually rather a concept that is made up of set of features that were unlocked and added by React 18.": {'start': 114.49, 'duration': 13.2}, 'Concurrency is all about processing multiple simultaneous state updates.': {'start': 127.69, 'duration': 5.22}, 'Consider a list that updates as a user types into an input field.': {'start': 132.91, 'duration': 4.16}, 'If there is a lot of data to be processed or the logic for processing the user input is rather complex, the user interface can get laggish and slow especially on slower devices.': {'start': 137.07, 'duration': 12.57}, 'In the past, prior to React version 18, React always processed all state updates in the order in which they were triggered.': {'start': 149.64, 'duration': 7.9}, 'And the next state update could only be processed once the previous one was done.': {'start': 157.54, 'duration': 4.75}, 'With React 18 and the addition of concurrency concept, you can tell React that a certain state update has a lower priority than another state update.': {'start': 162.29, 'duration': 9.52}, 'And React is then able to treat the other updates with higher priority.': {'start': 171.81, 'duration': 3.94}, 'Now, you tell React about a state update that has a lower priority by using one of the new APIs introduced with React 18.': {'start': 175.75, 'duration': 8.35}, "You can use the useTransition hook or the startTransition function in places where hooks can't be used.": {'start': 184.1, 'duration': 5.76}, "For example, in class based components to tell React that a certain state update process is about to start and that it shouldn't not wait for this process to finish before processing other state updates.": {'start': 189.86, 'duration': 13.33}, 'So the rap state update will have a lower priority.': {'start': 203.19, 'duration': 3.65}, "In other cases, you might have a value that's generated by some state update which you maybe don't directly control, and you can use useDeferredValue to let React know that an older version of the value should be shown until the new value is ready instead of waiting with the entire component and UI update until the new value is available.": {'start': 206.84, 'duration': 20.64}, 'Now, these functions and hooks are obviously, very new and therefore we will, of course have to see which patterns and best practices will emerge based on them.': {'start': 227.48, 'duration': 9.15}, 'You should definitely not start wrapping all your or state updating calls or all your values with those functions and hooks.': {'start': 236.63, 'duration': 7.46}, 'Instead, you should use them in niche cases where very complex calculations are going on where the interface is laggish and you have no other way of improving it, or you have no other obvious error that could be causing this behavior, then these functions and hooks can be helpful.': {'start': 244.09, 'duration': 15.28}, 'I do have a separate video, which of course is added as a link to this video where I take a closer look at these new hooks and functions though.': {'start': 259.37, 'duration': 7.8}, 'Now React 18, also introduces a couple of other functions which are primarily intended to be used by library authors.': {'start': 267.17, 'duration': 7.17}, 'These hooks solve specific problems which may be encountered by specific libraries like CSS and JavaScript libraries and they allow the authors of these libraries to work around any problems they might face and utilize the new concurrency features unlocked by React 18.': {'start': 274.34, 'duration': 16.98}, 'As an application developer, you will probably never work with these hooks.': {'start': 291.32, 'duration': 4.42}, 'Now, besides these new APIs and hooks you also get some changes for existing features.': {'start': 295.74, 'duration': 4.6}, 'For example, state batching.': {'start': 300.34, 'duration': 1.79}, "State batching already existed in older versions of React as well and it's all about grouping multiple state updating calls together so that they are executed as one state update call instead of multiple calls.": {'start': 302.13, 'duration': 12.02}, 'This ensures that the component to which the state updates belong is not evaluated and executed multiple times unnecessarily, but that at it in status only executed once.': {'start': 314.15, 'duration': 9.65}, 'Now, the problem is that with React 17 or older, this feature already existed, but it only worked inside of synchronous React event handler functions.': {'start': 323.8, 'duration': 9.16}, 'If you, for example, had a function that was triggered because a timer expired, state updates performed in that function were not batched together.': {'start': 332.96, 'duration': 7.98}, 'This changed with React 18 and state batching now always works no matter where you make your state updates.': {'start': 340.94, 'duration': 7.23}, 'Now, one note about this state batching example, if you try to reproduce this on your own with React 18, you might still see double log outputs for state changes that should be batched together.': {'start': 348.17, 'duration': 12.58}, 'And that is related to strict mode, which during development, and only there, renders a component twice to perform some extra checks.': {'start': 360.75, 'duration': 8.93}, "This able strict mode by removing it from index JS, if you have it there, and then thereafter, you'll see the updated state batch and behavior.": {'start': 369.68, 'duration': 7.88}, 'Another important change affects the suspense component.': {'start': 379.89, 'duration': 3.38}, 'The suspense component was also already added in older versions of React, and it can be used to be wrapped around lazily loaded components.': {'start': 383.27, 'duration': 8.1}, 'Lazy loading simply means that you implement code splitting to only load to code for a certain component when it is needed.': {'start': 391.37, 'duration': 7.4}, 'This can help with performance since less code has to be downloaded initially.': {'start': 398.77, 'duration': 4.32}, 'This is often used in combination with routing.': {'start': 403.09, 'duration': 2.8}, 'Now you could already use the suspense component to show a fallback component, for example, a loading spinner until the code for the lazily loaded component was downloaded.': {'start': 405.89, 'duration': 9.16}, 'However, prior to React version 18, you could not use the suspense component if you also used server site rendering.': {'start': 415.05, 'duration': 6.83}, 'Now, of course, many apps might not use that but if you did use it, you were not able to use the suspense component because it would cause an error.': {'start': 421.88, 'duration': 7.35}, 'With React 18 that changed and you can now use this component as you always were able to use it on the client side, on the server side as well.': {'start': 429.23, 'duration': 8.35}, 'As a side note, we will probably see more exciting changes to the suspense component in the future now that React 18 is out because the React team does plan to also make the suspense component work with data fetching not just with code fetching for lazily loaded components.': {'start': 437.58, 'duration': 15.96}, "The idea is that your components, if they're fetching data, can tell React that they are and tell React when they are done fetching data.": {'start': 453.54, 'duration': 8.83}, 'And then the suspense component, which is somewhere above the data fetching components in the component tree is able to show a fallback for the components that are fetching data until the data is there.': {'start': 462.37, 'duration': 11.46}, "This means that you won't have to manage the loading state manually inside of your components anymore and you can decouple the logic for doing that from your user interface.": {'start': 473.83, 'duration': 9.76}, "Now this feature is not there yet, but it's planned to be added in the future and React 18 also lays the foundation for that.": {'start': 483.59, 'duration': 6.79}, "Another exciting feature, which isn't there yet but which we'll probably see in the future now that React 18 was released, are server components.": {'start': 490.38, 'duration': 8.53}, 'These are components which are not just pre-rendered on the server, as you can already do it today with server site rendering.': {'start': 498.91, 'duration': 6.53}, 'But instead these are components which are meant to only execute on the server and yet work seamlessly together with client site components.': {'start': 505.44, 'duration': 7.61}, "Once this feature is added to React, it will effectively turn React into kind of a full stack framework or library which allows you to make server site with client site code so that you're not just limited to building user interfaces but you instead can also perform certain server site only logic in your React app.": {'start': 513.05, 'duration': 18.08}, 'This could be used for performing tasks on the server that should not run on the client for security or performance reasons.': {'start': 531.13, 'duration': 6.88}, 'This feature is not there yet.': {'start': 538.01, 'duration': 1.7}, "You can't yet use these components.": {'start': 539.71, 'duration': 2.08}, "It's an alpha stage only and will probably change a lot over the next months.": {'start': 541.79, 'duration': 4.93}, "But we will probably see it in the future and if you're interested in learning more about this feature or about the other features and concepts I mentioned in this video, you find some helpful resources attached to this video which allow you to dive deeper into all those concepts.": {'start': 546.72, 'duration': 14.83}}}